<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [702]:
import pandas as pd
import psycopg2

In [704]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [705]:
query_3_1 = f'''select COUNT(id)
                from vacancies
             '''

In [706]:
df_3_1 = pd.read_sql_query(query_3_1, connection) 
df_3_1

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3077626946.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_1 = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [707]:
query_3_2 = f'''select COUNT(id)
                from employers
             '''

In [708]:
df_3_2 = pd.read_sql_query(query_3_2, connection) 
df_3_2

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\4166817621.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_2 = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [709]:
query_3_3 = f'''select COUNT(id)
                from areas
             '''

In [710]:
df_3_3 = pd.read_sql_query(query_3_3, connection)
df_3_3

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3006110907.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_3 = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [711]:
query_3_4 = f'''select COUNT(id)
                from industries
             '''

In [712]:
df_3_4 = pd.read_sql_query(query_3_4, connection)
df_3_4

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\764330752.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_4 = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

выводы по предварительному анализу данных\

Выборка интересна и достаточно репрезентативна, поскольку охватывает разные регионы и сферы деятельности. Однако нет временных рядов, соответственно нельзя отследить динамику популярности вакансий или динамику регионов. Больше всего вопросов к категоригории региона, учитывая такое разнообразие вариантов можно предположить, что данные не обработаны и регионы вписывались в произвольном формате. Даже на уровне городов в базе данных можно агрегировать их на регионы (а не города непосредственно)

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [714]:
query_4_1 = f'''select 
                     a.name city,
                     COUNT(v.id)
                from vacancies v
                JOIN areas a ON a.id = v.area_id
                GROUP BY a.name
                ORDER BY 2 DESC
                LIMIT 5
             '''

In [715]:
df_4_1 = pd.read_sql_query(query_4_1, connection) 
df_4_1

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\2548059485.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_1 = pd.read_sql_query(query_4_1, connection)

              city  count
0           Москва   5333
1  Санкт-Петербург   2851
2            Минск   2112
3      Новосибирск   2006
4           Алматы   1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [716]:
query_4_2 = f'''select 
                     COUNT(v.id)
                from vacancies v
                WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL
             '''

In [717]:
df_4_2 = pd.read_sql_query(query_4_2, connection) 
df_4_2

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\756858082.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_2 = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [718]:
query_4_3 = f'''select 
                     AVG(salary_from) avg_sal_from,
                     AVG(salary_to) avg_sal_to
                from vacancies v
             '''

In [719]:
df_4_3 = round(pd.read_sql_query(query_4_3, connection),0) 
df_4_3

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\2563461767.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_3 = round(pd.read_sql_query(query_4_3, connection),0)

   avg_sal_from  avg_sal_to
0       71065.0    110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [720]:
query_4_4 = f'''select 
                     v.schedule,
                     v.employment,
                     COUNT(v.id)
                from vacancies v
                GROUP BY v.schedule, v.employment
                ORDER BY 3 DESC
             '''

In [721]:
df_4_4 = pd.read_sql_query(query_4_4, connection)
df_4_4

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1636312543.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_4 = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [722]:
query_4_5 = f'''select 
                     v.experience
                from vacancies v
                GROUP BY v.experience
                ORDER BY COUNT(v.experience)
                '''

In [723]:
df_4_5 = pd.read_sql_query(query_4_5, connection) 
df_4_5

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\379972773.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_5 = pd.read_sql_query(query_4_5, connection)

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

выводы по детальному анализу вакансий

В среднем работодатели ищут кандидатов на полный день с небольшим опытом и предлагают з/п в районе 100 тыс. рублей. Однако, половина вакансий указываются без заработной платы, что осложняет жизнь будущим работникам (поскольку тратятся дополнительные ресурсы на то, что может быть указано в вакансии) и "смазывает" результаты анализа. Ожидаемо, наибольшее предложение в крупных городах. Велика и популярность удаленной работы, которую также предлагают на полный день (вероятно спрос вырос после пандемии, но на текущей базе мы не можем это проверить).

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [868]:
query_5_1 = f'''(select 
                     e.name company
                from vacancies v
                JOIN employers e ON e.id = v.employer_id
                GROUP BY e.name
                ORDER BY COUNT(v.id) DESC
                LIMIT 1)                
                
                Union
                
                (select 
                     e.name
                from vacancies v
                JOIN employers e ON e.id = v.employer_id
                GROUP BY e.name
                ORDER BY COUNT(v.id) DESC
                OFFSET 4 LIMIT 1)

             '''

In [869]:
df_5_1 = pd.read_sql_query(query_5_1, connection)
df_5_1

# В выводе он отсортировал по алфавиту

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1909189112.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_1 = pd.read_sql_query(query_5_1, connection)

         company
0  Газпром нефть
1         Яндекс

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [870]:
query_5_2 = f'''select 
                     a.name area,
                     COUNT(e.id) count_employer,
                     COUNT(v.id) count_vacancies
                from areas a 
                LEFT JOIN employers e ON e.area = a.id
                LEFT JOIN vacancies v ON a.id = v.area_id
                WHERE v.id is null
                GROUP BY a.name
                ORDER BY 2 DESC
                LIMIT 1
                '''

In [871]:
df_5_2 = pd.read_sql_query(query_5_2, connection)
df_5_2

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\762398461.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_2 = pd.read_sql_query(query_5_2, connection)

     area  count_employer  count_vacancies
0  Россия             410                0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [897]:
query_5_3 = f'''select 
                     e.name employer,
                     count(distinct a.name) cnt_area
                from vacancies v
                JOIN employers e ON e.id = v.employer_id
                JOIN areas a ON a.id = v.area_id
                GROUP BY e.name
                ORDER BY 2 DESC
                LIMIT 5
                '''

In [898]:
df_5_3 = pd.read_sql_query(query_5_3, connection)
df_5_3

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3556584873.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_3 = pd.read_sql_query(query_5_3, connection)

                 employer  cnt_area
0                  Яндекс       181
1              Ростелеком       152
2              Спецремонт       116
3  Поляков Денис Иванович        88
4               ООО ЕФИН         71

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [899]:
query_5_4 = f'''select 
                     count(distinct e.id) emp
                from employers e
                left JOIN employers_industries ei ON ei.employer_id = e.id
                Where industry_id is null '''

In [900]:
df_5_4 = pd.read_sql_query(query_5_4, connection)
df_5_4

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\2345892774.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_4 = pd.read_sql_query(query_5_4, connection)

    emp
0  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [901]:
query_5_5 = f'''select 
                     e.name,
                     count(distinct industry_id)
                from vacancies v
                left JOIN employers_industries ei ON ei.employer_id = v.employer_id
                left JOIN employers e ON e.id = v.employer_id
                GRoup by e.id
                Having count(distinct industry_id) =4
                Order by 1 
                LIMIT 3
                '''

In [902]:
df_5_5 = pd.read_sql_query(query_5_5, connection)
df_5_5

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\480638788.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_5 = pd.read_sql_query(query_5_5, connection)

           name  count
0  101 Интернет      4
1      21vek.by      4
2          2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [903]:
query_5_6 = f'''select 
                     count(distinct employer_id)
                from employers_industries ei
                left JOIN industries i ON ei.industry_id = i.id
                where i.name ='Разработка программного обеспечения'
                
                '''

In [904]:
df_5_6 = pd.read_sql_query(query_5_6, connection)
df_5_6

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3865320243.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_6 = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

#
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8' # Определяем адрес страницы
response = requests.get(url) # Выполняем GET-запрос, содержимое ответа присваивается переменной response
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
cities = page.find('table', class_='standard sortable jquery-tablesorter')# Выводим текст из полученного тега, который содержится в атрибуте text
cities

In [905]:
# pip install lxml
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8' # Определяем адрес страницы
#response = requests.get(url) # Выполняем GET-запрос, содержимое ответа присваивается переменной response
table1 = pd.read_html(url)[1]
print(type(table1)) # убеждаемся, что тип DF
cities = table1.iloc[:,1] #вытаскиваем столбец с городами
# print(cities)
cities.iloc[13] = cities.iloc[13].replace('[a]', '') # Чистим Воронеж
#print(cities)
cities_tup = tuple(cities)
print(cities_tup) # Вставлять в скл надо в виде кортежа, а не сериес

<class 'pandas.core.frame.DataFrame'>
('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1346616785.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cities.iloc[13] = cities.iloc[13].replace('[a]', '') # Чистим Воронеж

In [906]:
query_5_7 = f'''select 
                     a.name,
                     count(v.id) cnt_vac
                from vacancies v
                JOIN employers e ON e.id = v.employer_id
                JOIN areas a ON a.id = v.area_id
                where a.name in {cities_tup} and e.name = 'Яндекс'
                group by a.name
                
                UNION ALL
                
                select 
                     'total', --формируем тотал
                     count(v.id)
                from vacancies v
                JOIN employers e ON e.id = v.employer_id
                JOIN areas a ON a.id = v.area_id
                where a.name in {cities_tup} and e.name = 'Яндекс'
                
                ORDER BY 2 DESC

                '''

In [907]:
df_5_7 = pd.read_sql_query(query_5_7, connection)
df_5_7

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\43835236.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_7 = pd.read_sql_query(query_5_7, connection)

               name  cnt_vac
0             total      485
1            Москва       54
2   Санкт-Петербург       42
3      Екатеринбург       39
4   Нижний Новгород       36
5       Новосибирск       35
6           Воронеж       32
7         Краснодар       30
8            Самара       26
9               Уфа       26
10            Пермь       25
11           Казань       25
12   Ростов-на-Дону       25
13        Волгоград       24
14       Красноярск       23
15        Челябинск       22
16             Омск       21

***

выводы по анализу работодателей

ТОП 4 из 5 компаний по числу вакансий из технологического сектора, или тесно с ним связанного. Яндекс из-за масштаба и смешанной деятельности фигурирует почти в каждом запросе. Остальные выводы в доп исследовании.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [909]:
query_6_1 = f'''select 
                     count(v.id) cnt_vac
                from vacancies v
                where lower(v.name) LIKE '%data%' 
                    OR lower(v.name) LIKE '%данн%' '''

In [910]:
df_6_1 = pd.read_sql_query(query_6_1, connection)
df_6_1

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1300834887.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_1 = pd.read_sql_query(query_6_1, connection)

   cnt_vac
0     1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [988]:
query_6_2 = f'''select 
                     count(v.id) cnt_vac
                from vacancies v
                where (lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%') 
                    AND
                    (lower(v.name) like '%junior%' 
                    OR lower(v.experience) like '%нет опыта%' 
                    OR lower(v.employment) like '%стажировка%')
                '''

In [989]:
df_6_2 = pd.read_sql_query(query_6_2, connection)
df_6_2

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\2048769617.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_2 = pd.read_sql_query(query_6_2, connection)

   cnt_vac
0       51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [990]:
query_6_3 = f'''select 
                     count(v.id) cnt_vac
                from vacancies v
                where (lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%') 
                    AND
                    (lower(v.key_skills) like '%sql%' 
                    OR lower(v.key_skills) like '%postgres%')
                '''

In [991]:
df_6_3 = pd.read_sql_query(query_6_3, connection)
df_6_3

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3192746363.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_3 = pd.read_sql_query(query_6_3, connection)

   cnt_vac
0      201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [992]:
query_6_4 = f'''select 
                     count(v.id) cnt_vac
                from vacancies v
                where (lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%') 
                    AND
                    lower(v.key_skills) like '%python%'
                '''

In [993]:
df_6_4 = pd.read_sql_query(query_6_4, connection)
df_6_4

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1319374162.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_4 = pd.read_sql_query(query_6_4, connection)

   cnt_vac
0      351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [994]:
query_6_5 = f'''select -- считаем среднее из столбца
                     avg(sep_key_skills) avg_key_skills 
                from (
                select -- подзапрос выделяем скилы в отдельный столбец по количеству разделителей +1 
                     ((LENGTH(v.key_skills) - LENGTH(replace(v.key_skills,CHR(9),''))) +1) sep_key_skills
                from vacancies v
                where lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' 
                group by v.id
                having v.key_skills <> '') table_1
                
                    
                '''

Если писать в коде, что не только слеш, но и запятая являются разделителями, то выходит 6.5, а не 6.4

In [995]:
df_6_5 = pd.read_sql_query(query_6_5, connection)
df_6_5

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1566661722.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_5 = pd.read_sql_query(query_6_5, connection)

   avg_key_skills
0        6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [996]:
query_6_6 = f'''select 
                     distinct v.experience,
                     avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to)) saslary
                from vacancies v
                where lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' 
                GROUP BY v.experience
                    '''

In [997]:
df_6_6 = round(pd.read_sql_query(query_6_6, connection))
df_6_6

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\895433908.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_6 = round(pd.read_sql_query(query_6_6, connection))

           experience   saslary
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  139675.0
3       От 3 до 6 лет  243115.0

***

выводы по предметному анализу

Вакансий в DS достаточно много, зачастую список навыков для специалистов достаточно велик (более 6), питон востребован больше, чем sql. Заработная плата растет пропорционально опыту, а для специалистов с большим стажем зачастую заработная плата определяется по узкой специализации . Еще таких специалистов часто ищут не на HH, следовательно выборка по данной категории невелика, но и сама специальность достаточно молодая.

# Общий вывод по проекту

подведем итог исследования, обобщите выводы
здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

Большинство работодателей предпочтитают, чтобы сотрудники присутствовали в офисе. Несмотря на то, что работа DS может быть полностью удаленной, более 60% вакансий в этой сфере подразумевают очное присутствие сотрудников. На первый взгляд, это касается молодых специалистов без опыта, но нет, среди 319 в DS на полную занятость и полный день, только 33 вакансии приходятся на джунов.

В среднем по всем вакансиям работодатели ищут специалистов на зп около 100 тысяч, среди DS средняя зп значительно выше (более 170 тыс.) и виден рост в соответствии с увеличением стажа. 

В целом в 90% вакансий указана предполагаемая зп, но среди вакансий DS только в трети указана зарплатная вилка. 

ТОП-3 сфер деятельности по числу вакансий (а это половина от всей базы данных) так или иначе связан с IT-сектором. На первом месте - разработка ПО (12,5 тыс. вакансий)

Поскольку нет временных рядов, сделать прогнозы не представляется возможным

In [998]:
# Форматы занятости для DS
query_7_1 = f'''select 
                     v.schedule,
                     v.employment,
                     COUNT(v.id)
                from vacancies v
                where lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' 
                GROUP BY v.schedule, v.employment
                ORDER BY 3 DESC
             '''
             
             
df_7_1 = round(pd.read_sql_query(query_7_1, connection))
df_7_1

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\2848510271.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_1 = round(pd.read_sql_query(query_7_1, connection))

           schedule           employment  count
0       Полный день     Полная занятость    319
1  Удаленная работа     Полная занятость    110
2     Гибкий график     Полная занятость     37
3     Гибкий график  Частичная занятость      4
4  Удаленная работа  Частичная занятость      3
5       Полный день           Стажировка      2
6  Удаленная работа     Проектная работа      2
7     Гибкий график           Стажировка      2
8       Полный день  Частичная занятость      1

In [999]:
# Форматы занятости для junior DS
query_7_2 = f'''select 
                     v.schedule,
                     v.employment,
                     COUNT(v.id)
                from vacancies v
                where (lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' )
                    AND
                    (lower(v.name) like '%junior%' 
                    OR lower(v.experience) like '%нет опыта%' 
                    OR lower(v.employment) like '%стажировка%')
                GROUP BY v.schedule, v.employment
                ORDER BY 3 DESC
             '''
             
             
df_7_2 = round(pd.read_sql_query(query_7_2, connection))
df_7_2

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1726804693.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_2 = round(pd.read_sql_query(query_7_2, connection))

           schedule           employment  count
0       Полный день     Полная занятость     33
1  Удаленная работа     Полная занятость      5
2     Гибкий график     Полная занятость      4
3     Гибкий график  Частичная занятость      3
4       Полный день           Стажировка      2
5     Гибкий график           Стажировка      2
6       Полный день  Частичная занятость      1
7  Удаленная работа  Частичная занятость      1

In [1000]:
# В скольких вакансиях указана зп
query_7_3 = f'''select 
                     count(distinct v.id) cnt_vac,   
                     count(coalesce(salary_from, salary_to)) cnt_full_sal   -- ненулевые зп          
                from vacancies v
                RIGHT JOIN employers e ON e.id = v.employer_id
                left JOIN employers_industries ei ON ei.employer_id = e.id
                '''
                

df_7_3 = round(pd.read_sql_query(query_7_3, connection))
df_7_3

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3067417004.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_3 = round(pd.read_sql_query(query_7_3, connection))

   cnt_vac  cnt_full_sal
0    49197         42327

In [1001]:
# В скольких вакансиях для DS указана зп
query_7_4 = f'''select 
                     count(distinct v.id) cnt_vac,   
                     count(coalesce(salary_from, salary_to)) cnt_full_sal   -- ненулевые зп          
                from vacancies v
                RIGHT JOIN employers e ON e.id = v.employer_id
                left JOIN employers_industries ei ON ei.employer_id = e.id
                where (lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' ) '''
                    
df_7_4 = round(pd.read_sql_query(query_7_4, connection))
df_7_4

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\3794826972.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_4 = round(pd.read_sql_query(query_7_4, connection))

   cnt_vac  cnt_full_sal
0      480           112

In [1002]:
#средняя зп для DS 

query_7_5 = f'''select 
                     avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to)) saslary
                from vacancies v
                where lower(v.name) like '%data scientist%' 
                    OR lower(v.name) like '%data science%' 
                    OR lower(v.name) like '%исследователь данных%' 
                    OR (v.name like '%ML%' AND v.name not like '%HTML%') 
                    OR lower(v.name) like '%machine learning%' 
                    OR lower(v.name) like '%машинн%обучен%' 
                    '''
                    
df_7_5 = round(pd.read_sql_query(query_7_5, connection))
df_7_5

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\1223739238.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_5 = round(pd.read_sql_query(query_7_5, connection))

    saslary
0  177379.0

In [1007]:
#в какой сфере деятельности больше всего вакансий

query_7_6 = f'''select 
                     i.name industry,
                     count(v.id) vacancy
                from employers_industries ei
                left JOIN industries i ON ei.industry_id = i.id
                left JOIN vacancies v ON ei.employer_id = v.employer_id
                group by i.name
                order by 2 desc
                '''
               

df_7_6 = round(pd.read_sql_query(query_7_6, connection))
df_7_6

C:\Users\Lyudmila\AppData\Local\Temp\ipykernel_11156\704288955.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7_6 = round(pd.read_sql_query(query_7_6, connection))

                                              industry  vacancy
0                  Разработка программного обеспечения    12499
1    Системная интеграция,  автоматизации технологи...    11034
2    Интернет-компания (поисковики, платежные систе...     6413
3                                                 Банк     2742
4                                      Мобильная связь     1585
..                                                 ...      ...
289                                          Химчистка        4
290             Ассоциация в сфере культуры, искусства        2
291                                  Ритуальные услуги        1
292                                          Автошкола        1
293              Ботанический сад, зоопарк, заповедник        0

[294 rows x 2 columns]